RailsDeviseApp/app/controllers/blogposts_controller.rb

  def index
    @data = Blogpost.all.order('created_at desc')
---
SELECT "blogposts".* FROM "blogposts" ORDER BY created_at desc

  def add
    @blogpost = Blogpost.new
    @genres = Bloggenre.all
    if request.post? then
      @blogpost = Blogpost.create blogposts_params
---
SELECT "bloggenres".* FROM "bloggenres"
INSERT INTO "blogposts" ("title", "read", "bloggenre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "チャーハンに挑戦"], ["read", "チャーハンに挑戦したっす！"], ["bloggenre_id", 1], ["created_at", "2021-02-13 16:38:48.400908"], ["updated_at", "2021-02-13 16:38:48.400908"]]

  def edit
    @blogpost = Blogpost.find params[:id]
    @genres = Bloggenre.all
    if request.patch? then
      @blogpost.update blogposts_params
---
SELECT "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "bloggenres".* FROM "bloggenres"
UPDATE "blogposts" SET "updated_at" = ? WHERE "blogposts"."id" = ?  [["updated_at", "2021-02-13 16:38:48.480980"], ["id", 1]]