RailsDeviseApp/app/controllers/bloggenres_controller.rb

SELECT "bloggenres".* FROM "bloggenres"
---
  def index
    @data = Bloggenre.all

INSERT INTO "bloggenres" ("name", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "料理ブログ"], ["memo", "料理に関するブログです"], ["created_at", "2021-02-13 16:35:43.452563"], ["updated_at", "2021-02-13 16:35:43.452563"]]
---
  def add
    @bloggenre = Bloggenre.new
    if request.post? then
      @bloggenre = Bloggenre.create bloggenre_params