RailsDeviseApp/app/controllers/blogs_controller.rb

  def index
    @data = Blogpost.order('created_at desc').page params[:page]
    @blogconfig = Blogconfig.find 1
---
SELECT "blogposts".* FROM "blogposts" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogposts"
SELECT "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def genre
    @genre = Bloggenre.find params[:id]
    @data = Blogpost.where('bloggenre_id = ?',params[:id]).order('created_at desc').page params[:page]
    @blogconfig = Blogconfig.find 1
---
SELECT "bloggenres".* FROM "bloggenres" WHERE "bloggenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "blogposts".* FROM "blogposts" WHERE (bloggenre_id = '1') ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogposts" WHERE (bloggenre_id = '1')
SELECT "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @blogpost = Blogpost.find params[:id]
    @blogconfig = Blogconfig.find 1
---
SELECT "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]