RailsDeviseApp/app/controllers/blogconfigs_controller.rb

  def index
    @blogconfig = Blogconfig.find 1
---
SELECT "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @blogconfig = Blogconfig.find 1
    if request.patch? then
      @blogconfig.update blogconfig_params
---
SELECT "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogconfigs" SET "stylename" = ?, "updated_at" = ? WHERE "blogconfigs"."id" = ?  [["stylename", "red"], ["updated_at", "2021-02-13 16:25:47.025699"], ["id", 1]]