RailsDeviseApp/app/controllers/board_comments_controller.rb

  def index
    @board_comments = BoardComment.page(params[:page]).order('created_at desc')
    users = BoardUser.where('account_id == ?', current_account.id)[0]
    if users == nil then
      user = BoardUser.new
      user.account_id = current_account.id
      user.nickname = '<<no name>>'
      user.save
      users = BoardUser.where 'account_id == ?', current_account.id
---
SELECT "board_comments".* FROM "board_comments" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "board_comments"
SELECT "board_users".* FROM "board_users" WHERE (account_id == 1)
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? ORDER BY "accounts"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @board_comment = BoardComment.page(params[:page]).order('created_at desc')
    @board_comment = BoardComment.new(board_comment_params)
    @board_user = BoardUser.where('account_id == ?', current_account.id)[0]

    respond_to do |format|
      if @board_comment.save
---
SELECT "board_users".* FROM "board_users" WHERE (account_id == 1)
INSERT INTO "board_comments" ("content", "board_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "こんちゃー"], ["board_user_id", 1], ["created_at", "2021-02-13 14:39:11.842510"], ["updated_at", "2021-02-13 14:39:11.842510"]]

    def set_board_comment
      @board_comment = BoardComment.find(params[:id])
---
SELECT "board_comments".* FROM "board_comments" WHERE "board_comments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]