RailsDeviseApp/app/controllers/board_users_controller.rb

SELECT "board_users".* FROM "board_users" WHERE (account_id == 1)
---
  def index
    users = BoardUser.where 'account_id == ?', current_account.id

SELECT "board_users".* FROM "board_users" WHERE "board_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @board_user = BoardUser.find params[:id]

UPDATE "board_users" SET "nickname" = ?, "memo" = ?, "updated_at" = ? WHERE "board_users"."id" = ?  [["nickname", "たろ～"], ["memo", "たろうだよ"], ["updated_at", "2021-02-13 14:37:50.727408"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @board_user.update(board_user_params)

SELECT "board_users".* FROM "board_users" WHERE "board_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_board_user
      @board_user = BoardUser.find(params[:id])