RailsDeviseApp/app/controllers/board_messages_controller.rb

SELECT "board_users".* FROM "board_users" WHERE (account_id == 1)
INSERT INTO "board_users" ("nickname", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nickname", "<<no name>>"], ["account_id", 1], ["created_at", "2021-02-13 14:14:17.601132"], ["updated_at", "2021-02-13 14:14:17.601132"]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? ORDER BY "accounts"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @board_messages = BoardMessage.page(params[:page]).order('created_at desc')
    users = BoardUser.where('account_id == ?', current_account.id)[0]
    if users == nil then
      user = BoardUser.new
      user.account_id = current_account.id
      user.nickname = '<<no name>>'
      user.save
      users = BoardUser.where 'account_id == ?', current_account.id