RailsDeviseApp/app/controllers/data_pages_controller.rb

SELECT "data_pages".* FROM "data_pages" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "data_pages" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @data_pages = DataPage.page params[:page]

SELECT "data_pages".* FROM "data_pages" WHERE "data_pages"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_data_page
      @data_page = DataPage.find(params[:id])