RailsDeviseApp/app/views/layouts/blogs.html.erb

SELECT "bloggenres".* FROM "bloggenres"
---
    <div id="side">
    <% Bloggenre.all.each do |genre| %>